Repository: OleksandrTsvik/Elers
Catalog: API/Resources/*.po
Languages: uk

source: ReadPermission
uk: Перегляд інформації про дозволи. Дозволяє користувачу отримати весь список даних про дозволи.

source: CreateRole
uk: Створення ролі. Дозволяє користувачу створювати нові ролі.

source: ReadRole
uk: Перегляд інформації про ролі. Дозволяє користувачу переглядати інформацію про існуючі ролі та їхні дозволи.

source: UpdateRole
uk: Оновлення ролі. Дозволяє користувачу змінювати інформацію ролей та їх дозволи.

source: DeleteRole
uk: Видалення ролі. Дозволяє користувачу видаляти існуючі ролі.

source: CreateUser
uk: Створення користувача. Дозволяє користувачу створювати нових користувачів в системі.

source: ReadUser
uk: Перегляд інформації про користувача. Дозволяє користувачу переглядати дані користувачів системи.

source: UpdateUser
uk: Оновлення користувача. Дозволяє користувачу змінювати інформацію користувачів системи.

source: DeleteUser
uk: Видалення користувача. Дозволяє користувачу видаляти існуючих користувачів з системи.

source: Remove unnecessary spaces at the beginning or end.
uk: Видаліть зайві пробіли на початку чи в кінці.

source: The link is invalid.
uk: Посилання недійсне.

source: Bad Request. Please check your data and try again.
uk: Некоректний запит. Переконайтеся, що введено правильні дані.

source: Error.NullValue
uk: Надано значення null.

source: Error.NullResult
uk: Надано результат null.

source: Courses.NotFound
uk: Курс з Id = '{0}' не знайдено.

source: CourseTabs.NotFound
uk: Вкладка курсу з Id = '{0}' не знайдено.

source: RefreshTokens.InvalidToken
uk: Недійсний токен оновлення.

source: Roles.NotFound
uk: Роль з Id = '{0}' не знайдено.

source: Roles.NameNotUnique
uk: Роль із назвою = '{0}' уже існує.

source: Users.NotFound
uk: Користувача з Id = '{0}' не знайдено.

source: Users.NotFoundByEmail
uk: Користувача з електронною поштою = '{0}' не знайдено.

source: Users.EmailNotUnique
uk: Вказана електронна адреса уже використовується.

source: Users.InvalidCredentials
uk: Неправильна адреса електронної пошти або пароль.

source: Users.NotFoundByUserContext
uk: Користувач не знайдений.

source: Users.Unauthorized
uk: Щоб отримати доступ до цього ресурсу, пройдіть авторизацію.

source: Internal Server Error.
uk: Внутрішня помилка сервера.

source: Validation Error.
uk: Помилка валідації даних.

source: Success and error states are contradictory.
uk: Стани успіху та помилки суперечать один одному.

source: The result value cannot be accessed due to an error.
uk: Через помилку неможливо отримати доступ до значення результату.

source: User id is unavailable.
uk: Ідентифікатор користувача недоступний.
